mock-mpi/requests/1309-with-no-vista-sites.xml

<?xml version='1.0' encoding='UTF-8'?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
    <S:Body>
        <ns2:PRPA_IN201309UV02 xmlns="urn:hl7-org:v3" xmlns:ns2="http://vaww.oed.oit.va.gov" ITSVersion="XML_1.0">
            <id root="1.2.840.114350.1.13.0.1.7.1.1" extension="MCID-MMPI_2a01c192-ee19-4cfe-89f2-63ecab8bc558"/>
            <creationTime value="20201209200627546"/>
            <versionCode code="3.5"/>
            <interactionId root="2.16.840.1.113883.1.6"/>
            <processingCode code="T"/>
            <processingModeCode code="T"/>
            <acceptAckCode code="AL"/>
            <receiver typeCode="RCV">
                <device classCode="DEV" determinerCode="INSTANCE">
                    <id root="2.16.840.1.113883.4.349"/>
                </device>
            </receiver>
            <sender typeCode="SND">
                <device classCode="DEV" determinerCode="INSTANCE">
                    <id root="2.16.840.1.113883.3.42.10001.100001.12" extension="200MMPIE"/>
                    <asAgent xmlns:ns3="urn:hl7-org:v3" classCode="AGNT">
                        <representedOrganization classCode="ORG" determinerCode="INSTANCE">
                            <ns3:id root="2.16.840.1.113883.4.349" extension="200MMPIG"/>
                        </representedOrganization>
                    </asAgent>
                </device>
            </sender>
            <controlActProcess classCode="CACT" moodCode="EVN">
                <code code="PRPA_TE201309UV02" codeSystem="2.16.840.1.113883.1.6"/>
                <dataEnterer typeCode="ENT" contextControlCode="AP">
                    <assignedPerson classCode="ASSIGNED">
                        <id root="2.16.840.1.113883.4.349" extension="200MMPIG"/>
                        <assignedPerson xmlns:ns3="urn:hl7-org:v3" xmlns="" classCode="PSN" determinerCode="INSTANCE">
                            <ns3:name>
                                <given>MMPI</given>
                                <family>LIGHTHOUSE</family>
                            </ns3:name>
                        </assignedPerson>
                    </assignedPerson>
                </dataEnterer>
                <queryByParameter xmlns:ns3="urn:hl7-org:v3">
                    <ns3:queryId root="1.2.840.114350.1.13.99999.4567.34" extension="MY_TST_9703"/>
                    <ns3:statusCode code="new"/>
                    <ns3:responsePriorityCode code="I"/>
                    <ns3:parameterList>
                        <ns3:patientIdentifier>
                            <ns3:value root="2.16.840.1.113883.4.349" extension="1010101010V666666^NI^200M^USVHA"/>
                            <ns3:semanticsText>Patient.Id</ns3:semanticsText>
                        </ns3:patientIdentifier>
                    </ns3:parameterList>
                </queryByParameter>
            </controlActProcess>
        </ns2:PRPA_IN201309UV02>
    </S:Body>
</S:Envelope>
